/**
 * NC88 寻找第K大
 * 难度：中等
 * <p>
 * 题目描述
 * 有一个整数数组，请你根据快速排序的思路，找出数组中第K大的数。
 * <p>
 * 给定一个整数数组a,同时给定它的大小n和要找的K(K在1到n之间)，请返回第K大的数，保证答案存在。
 * <p>
 * 示例1
 * 输入
 * [1,3,5,2,2],5,3
 * 返回值
 * 2
 */

package com.newcoder;

import java.util.Arrays;

class Finder {
    public int findKth(int[] a, int n, int K) {
        // write code here
        Arrays.sort(a);
        return a[n - K];
    }
}

public class NC88 {
    public static void main(String[] args) {
        Finder solution = new Finder();

//        int a[] = {1, 3, 5, 2, 2};
//        int n = 5;
//        int K = 3;
        int a[] = {1332802,1177178,1514891,871248,753214,123866,1615405,328656,1540395,968891,1884022,252932,1034406,1455178,821713,486232,860175,1896237,852300,566715,1285209,1845742,883142,259266,520911,1844960,218188,1528217,332380,261485,1111670,16920,1249664,1199799,1959818,1546744,1904944,51047,1176397,190970,48715,349690,673887,1648782,1010556,1165786,937247,986578,798663};
        int n = 49;
        int K = 24;
        System.out.println(solution.findKth(a, n, K));
    }
}
